Revit 2024 API
BuiltInFailures.BendFailures.NotBentMaskingRegion Property
 While making curved beam type "[Type Name]" Masking Region elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentMaskingRegion { get; }
Visual Basic
Public Shared ReadOnly Property NotBentMaskingRegion As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentMaskingRegion {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace